car1 = {
    brand: "Audi",
    model: "A4",
    year: 2017,
}


/* якщо об’єкти мають ключі з однаковим іменем, то в консоль виведеться останнє зачення.
Тому ключ brand я залишаю незмінним (бо обидві Audi, а інші ключі міняю, бо там різні значення.
*/

car2 = {
    brand: "Audi",
    type: "R8",
    since: 2020,
}

car3 = { ...car1, ...car2 };

console.log(car3);

// АБО так, тоді ключі можуть бути однакові як в car1 так і в car2:

const car4 = {
    car1: { ...car1 },
    car2: { ...car2 },
};

console.log(car4);
